app/controllers/enquiries_controller.rb

  def index
    @enquiries = Enquiry.all
---
SELECT `enquiries`.* FROM `enquiries`

  def show
    @enquiry = Enquiry.find(params[:id])
---
SELECT `enquiries`.* FROM `enquiries` WHERE `enquiries`.`id` = 1 LIMIT 1

  def edit
    @enquiry = Enquiry.find(params[:id])
---
SELECT `enquiries`.* FROM `enquiries` WHERE `enquiries`.`id` = 1 LIMIT 1

  def create
    @enquiry = Enquiry.new(params[:enquiry])

    respond_to do |format|
      if @enquiry.save
---
INSERT INTO `enquiries` (`content`, `created_at`, `email`, `updated_at`, `phone`) VALUES ('testing enquiry', '2011-08-02 04:49:17', 'julines.liong@sydney.edu.au', '2011-08-02 04:49:17', '')

  def update
    @enquiry = Enquiry.find(params[:id])
---
SELECT `enquiries`.* FROM `enquiries` WHERE `enquiries`.`id` = 1 LIMIT 1